findSurfIntDirs(Surface!System.Runtime.CompilerServices.IsConst*,UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Surface!System.Runtime.CompilerServices.IsConst*,UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Arr&lt;EdgePntVec&gt;*,Arr&lt;XYZUtils.XYZ&gt;*,TangentSurfIntInfo*)
Determine the directions of the intersection of two surfaces. There are several cases:
1) If both surfaces are regular at the intersection point and the surfaces are
transverse there, two opposite direction vectors are returned.
2) If both surfaces are regular at the intersection point and the surfaces are
tangent there, this method returns the intersection direction(s) for the second
order approximations of the surfaces. If the surfaces agree to second order,
ERR_SINGULAR is returned.
3) If one surface is regular and the other is singular at the intersection point,
this method returns the intersection directions of the tangent plane of the regular
surface with the tangent cone of the singular surface.
4) ERR_SINGULAR is returned for remaining singular cases (e.g., coincident surfaces).
Output argument pEPVs contains the intersection directions represented in the
surface parameter spaces (indices 0/1 correspond to pSurf0/pSurf1, respectively).
Output:
pEPVs: contains the intersection directions represented in the parameters spaces
of the surfaces (sides 0/1 correspond to pSurf0/pSurf1, respectively).
pDirs: is parallel to pEPVs and contains the 3D directions. The caller could
derive the 3D directions from pEPVs, but this argument avoids the need to do so.
pTangentSurfInfo: if this function returns ERR_SUCCESS and the surfaces are tangent
at the intersection point, pTangentSurfInfo->tangentIntersection() will return true
and pTangentSurfInfo->estimateDeviations can be used to estimate the rate at which
the surfaces diverge.